# ElementCategoryChangeInvalidatesTagUpgrade Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TagFailures..::..ElementCategoryChangeInvalidatesTagUpgrade Property
BuiltInFailures..::..TagFailures Class See Also
---
During upgrade, Revit discovered that the highlighted elements were marked with tags of the wrong category. These tags were deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementCategoryChangeInvalidatesTagUpgrade { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementCategoryChangeInvalidatesTagUpgrade As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementCategoryChangeInvalidatesTagUpgrade {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TagFailures Class
Autodesk.Revit.DB Namespace